DataProcessors/ПанельАдминистрированияБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ПанельАдминистрированияБП</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименяетсяОсвобождениеОтУплатыНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СложныйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСДо2014Года</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСНаСчете19</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпрощенныйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьНДСПоОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьНДСПриПередачеНедвижимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРегистрацииСчетовФактурНаАванс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьДолюВычета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезопаснаяДоляВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПанельАдминистрированияБП/Forms/Интерфейс/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТолькоПросмотр = НЕ ПравоДоступа("Изменение", Метаданные.Константы.ИнтерфейсТакси)
		ИЛИ НЕ ПравоДоступа("Изменение", Метаданные.Константы.ИнтерфейсТаксиПростой);
		
	Элементы.ВариантИнтерфейса.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ИспользоватьТабличныеФормыБанковскихДокументов.ТолькоПросмотр = ТолькоПросмотр;
	
	ВестиУчетПоОрганизациям = ПолучитьФункциональнуюОпцию("ВестиУчетПоОрганизациям");
	СистемаНалогообложенияТребуетПолныйИнтерфейс = УчетнаяПолитика.ТребуетсяПолныйИнтерфейс();
	ИспользуетсяФункциональностьПолногоИнтерфейса = Обработки.ФункциональностьПрограммы.ТребуетсяПолныйИнтерфейс();
	
	БлокироватьПростойИнтерфейс = ВестиУчетПоОрганизациям;
	ВыводитьПредупреждениеПростойИнтерфейс = СистемаНалогообложенияТребуетПолныйИнтерфейс
		ИЛИ ИспользуетсяФункциональностьПолногоИнтерфейса;
	
	Элементы.ОграничениеПростогоИнтерфейсаРаздельныйУчетНДС.Видимость = СистемаНалогообложенияТребуетПолныйИнтерфейс;
	Элементы.ОграничениеПростогоИнтерфейсаФункциональность.Видимость = ИспользуетсяФункциональностьПолногоИнтерфейса;
	
	// Значения реквизитов формы
	Если Константы.ИнтерфейсТакси.Получить() Тогда
		ВариантИнтерфейса = "ИнтерфейсТакси";
	ИначеЕсли Константы.ИнтерфейсТаксиПростой.Получить() Тогда
		ВариантИнтерфейса = "ИнтерфейсТаксиПростой";
	ИначеЕсли Константы.ИнтерфейсВерсии77.Получить() Тогда
		ВариантИнтерфейса = "ИнтерфейсВерсии77";
	Иначе
		ВариантИнтерфейса = "";
	КонецЕсли;
	
	ВариантИнтерфейсаДоИзменения = ВариантИнтерфейса;
	Если ВариантИнтерфейса = "" Тогда
		ВариантИнтерфейса = "ИнтерфейсТаксиПростой";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантИнтерфейсаПриИзменении(Элемент)
	
	ИнтерфейсИзменен = ВариантИнтерфейсаДоИзменения <> ВариантИнтерфейса;
	ВыбранПростойИнтерфейс = ВариантИнтерфейса = "ИнтерфейсТаксиПростой";
	
	Если ВыбранПростойИнтерфейс Тогда
		ДоступноИзменениеИнтерфейсаБезПредупреждений = ИнтерфейсИзменен 
			И НЕ БлокироватьПростойИнтерфейс 
			И НЕ ВыводитьПредупреждениеПростойИнтерфейс;
	Иначе
		ДоступноИзменениеИнтерфейсаБезПредупреждений = ИнтерфейсИзменен;
	КонецЕсли;
	
	Элементы.БлокировкаПростойИнтерфейс.Видимость = ИнтерфейсИзменен
		И ВыбранПростойИнтерфейс
		И БлокироватьПростойИнтерфейс;
		
	Элементы.ГруппаПредупреждениеПростойИнтерфейс.Видимость = ИнтерфейсИзменен
		И ВыбранПростойИнтерфейс
		И ВыводитьПредупреждениеПростойИнтерфейс
		И НЕ БлокироватьПростойИнтерфейс;
		
	Элементы.ГруппаПерезапускКнопка.Видимость = ДоступноИзменениеИнтерфейсаБезПредупреждений;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТабличныеФормыБанковскихДокументовПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОграничениеПростогоИнтерфейсаРаздельныйУчетНДСОбработкаНавигационнойСсылки(
	Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КлючЗаписи = ЗаписьНастройкиВедетсяРаздельныйУчетНДС();
	
	Если КлючЗаписи <> Неопределено Тогда
		ПараметрыОткрытия = Новый Структура("Ключ", КлючЗаписи);
		ОткрытьФорму("РегистрСведений.НастройкиУчетаНДС.ФормаЗаписи", ПараметрыОткрытия, ЭтаФорма, "");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перезапустить(Команда)
	
	УстановитьИнтерфейсНаСервере(ВариантИнтерфейса);
	
	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьИнтерфейсНаСервере(ВариантИнтерфейса)

	ОбщегоНазначенияБП.УстановитьРежимКомандногоИнтерфейса(ВариантИнтерфейса);
	ХранилищеОбщихНастроек.Сохранить(ВРег("ДатаСменыИнтерфейса"),,ТекущаяДатаСеанса(),,);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	Результат = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	Результат = Новый Структура;
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	СохранитьЗначениеРеквизита(РеквизитПутьКДанным, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СохранитьЗначениеРеквизита(РеквизитПутьКДанным, Результат)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат;
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписьНастройкиВедетсяРаздельныйУчетНДС()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиУчетаНДС.Период КАК Период,
	|	НастройкиУчетаНДС.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС КАК НастройкиУчетаНДС
	|ГДЕ
	|	НастройкиУчетаНДС.СложныйУчетНДС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отбор = Новый Структура("Период, Организация", Выборка.Период, Выборка.Организация);
		Возврат РегистрыСведений.НастройкиУчетаНДС.СоздатьКлючЗаписи(Отбор);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

#КонецОбласти
